app/views/departments/index.html.erb

  </table>
  <h2><%=t('departments.all.dept')%></h2>
---
SELECT `departments`.* FROM `departments` ORDER BY position ASC

      <th class="center"><%=t('departments.all.dept_description')%></th>
      <th class="center"><%=t('departments.all.dept_head_name')%></th>
---
SELECT `departments`.* FROM `departments` ORDER BY position ASC