app/views/schools/index.html.erb

SELECT `schools`.* FROM `schools` ORDER BY position ASC
---
<div class="school index">
  <h2><%=t('schools.all.sch')%></h2>

SELECT `schools`.* FROM `schools` ORDER BY position ASC
---
          <td class="actions">
            <%= link_to t('schools.all.sch_dept'), departments_path(school_id: school.id)%>