app/controllers/departments_controller.rb

  def create
    @department = Department.new(department_params)
    if @department.save
---
INSERT INTO `departments` (`name`, `position`, `head_name`, `description`, `capacity`, `created_at`, `updated_at`) VALUES ('mmk', 13, 'khjh', '', 500, '2018-09-18 07:55:53', '2018-09-18 07:55:53')

  def destroy
    @department.destroy
---
DELETE FROM `departments` WHERE `departments`.`id` = 8

  def find_department_id
    @department = Department.find(params[:id])
---
SELECT  `departments`.* FROM `departments` WHERE `departments`.`id` = 14 LIMIT 1