app/controllers/schools_controller.rb

  def edit
    @school = School.find(params[:id])
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 22 LIMIT 1  [["id", 22], ["LIMIT", 1]]

  def set_school
    @school = School.find(params[:id])
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 22 LIMIT 1